app/views/users/show.html.erb

         <small>
           <%= pluralize(@user.items.count, 'item') %>
---
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 5]]