app/controllers/items_controller.rb

INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Buying baboons"], ["user_id", 5], ["created_at", "2017-09-13 17:12:14.507423"], ["updated_at", "2017-09-13 17:12:14.507423"]]
---
  def create
    @item = current_user.items.new(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
  def destroy
    @item = Item.find(params[:id])
    if @item.destroy